app/Controllers/Home.php

    public function login()
    {
        $user = new ModelUser();
        $uname = $this->request->getVar('username'); // Menggunakan getVar, bukan getVAr
        $psw = $this->request->getVar('password'); // Menggunakan getVar, bukan getVAr
        $ada = $user->where("username = '$uname' AND password = '$psw'")->first();
---
SELECT *
FROM `user`
WHERE `username` = 'ikhsansir' AND `password` = '123'
 LIMIT 1