app/Controllers/Ikhsan_produk.php

SELECT *
FROM `tbl_barang`
WHERE `kode_barang` = '3432'
 LIMIT 1
INSERT INTO `tbl_barang` (`kode_barang`, `nama_barang`, `satuan`, `harga_beli`, `harga_jual`, `stok`) VALUES ('3432', 'Baju', 'pcs', '50000', '100000', '8')
---
    public function create()
    {
        $session = session();
        // Mengambil data dari request
        $kode_barang = $this->request->getVar('kode_barang');
        $nama_barang = $this->request->getVar('nama_barang');
        $satuan = $this->request->getVar('satuan');
        $harga_beli = $this->request->getVar('harga_beli');
        $harga_jual = $this->request->getVar('harga_jual');
        $stok = $this->request->getVar('stok');


         // Data yang akan disimpan ke database
        $data = [
                'kode_barang' => $kode_barang,
                'nama_barang' => $nama_barang,
                'satuan' => $satuan,
                'harga_beli' => $harga_beli,
                'harga_jual' => $harga_jual,
                'stok'      => $stok
            ];

            $ada = $this->produkModel->where('kode_barang', $kode_barang)->first();
            if (!$ada) {
                $this->produkModel->insert($data);