app/Models/ModelProdi.php

    public function getJurusanProdi()
    {
        return $this->db->table('tprodi')
        ->join('tjurusan', 'tjurusan.id=tprodi.id_jurusan')
        ->orderBy('id_jurusan')
        ->get()->getResultArray();
---
SELECT *
FROM `tprodi`
JOIN `tjurusan` ON `tjurusan`.`id`=`tprodi`.`id_jurusan`
ORDER BY `id_jurusan`